Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
/**
 * @file hardware_init.c
 * @brief Application-Specific Hardware Initialization - Motor Control, Sensors, Communication
 *
 * @details
 * # Overview
 *
 * This file implements **Stage 2 of the boot sequence** - application-specific peripheral
 * initialization. It is called **after** system clocks are configured (rx_clock_power_init)
 * but **before** ThreadX RTOS starts (tx_kernel_enter).
 *
 * **Boot sequence context:**
 * ```
 * main() -> rx_clock_power_init() -> hardware_init() -> tx_kernel_enter()
 *           ^ System clocks        ^ This file      ^ Start RTOS
 * ```
 *
 * ## Peripheral Initialization Order (7 Stages)
 *
 * **Critical ordering** - later stages depend on earlier stages:
 *
 * 1. **Precondition validation** (~0.5 us)
 *    - Verify system clocks initialized (SCKCR3 register check)
 *    - Ensure memory-mapped I/O accessible
 *
 * 2. **GPIO configuration** (planned, not yet implemented)
 *    - Motor control pins (PWM enable, GTETRG fault detection)
 *    - LED indicators (status, error, activity)
 *    - Sensor chip selects (SPI CS pins)
 *
 * 3. **Timers** (~10 us) **IMPLEMENTED**
 *    - CMT0 for ThreadX tick (1 kHz)
 *    - GPTW for PWM generation (motor control)
 *
 * 4. **UART debug** - MOVED TO MAIN()
 *    - SCI9 initialized in main() before hardware_init() is called
 *    - Error logging available for all peripheral init below
 *    - See main.c for early UART initialization
 *
 * 5. **Communication peripherals** (planned, not yet implemented)
 *    - SPI for RPi5 communication and sensors
 *    - I2C for IMU, temperature sensors
 *    - USB CDC for ROS2 communication
 *
 * 6. **ADC channels** (planned, not yet implemented)
 *    - Current sensing (motor protection)
 *    - Temperature sensing (thermal management)
 *
 * ## Hardware Initialization Architecture
 *
 * @dot
 * digraph hardware_init {
 *   rankdir=TB;
 *   node [shape=box];
 *
 *   Entry [label="hardware_init()", shape=ellipse];
 *   Precond [label="Precondition Check\nSCKCR3 != reset state"];
 *   GPIO [label="GPIO Init\n(Planned)", style=dashed];
 *   Timers [label="Timer Init\nCMT0 @ 1 kHz", style=filled, fillcolor=lightgreen];
 *   UART [label="UART Debug Init\nSCI9 @ 115200", style=filled, fillcolor=lightgreen];
 *   SPI [label="SPI Init\n(Planned)", style=dashed];
 *   I2C [label="I2C Init\n(Planned)", style=dashed];
 *   ADC [label="ADC Init\n(Planned)", style=dashed];
 *   Postcond [label="Postcondition Check\nSCKCR3 still valid"];
 *   Exit [label="return k_rx_ok", shape=ellipse];
 *
 *   Entry -> Precond;
 *   Precond -> GPIO [label="Assert OK"];
 *   GPIO -> Timers;
 *   Timers -> UART [label="k_rx_ok"];
 *   UART -> SPI [label="k_rx_ok"];
 *   SPI -> I2C;
 *   I2C -> ADC [label="k_rx_ok"];
 *   ADC -> Postcond;
 *   Postcond -> Exit [label="Assert OK"];
 *
 *   Timers -> Halt [label="Error", color=red];
 *   UART -> Halt [label="Error", color=red];
 *   SPI -> Halt [label="Error", color=red];
 *
 *   Halt [label="return error", shape=octagon, color=red];
 * }
 * @enddot
 *
 * ## Initialization Timing (RX72N @ 240 MHz)
 *
 * | Stage | Duration | Implementation | Notes |
 * |-------|----------|----------------|-------|
 * | **Precondition check** | ~0.5 us | [COMPLETE] | SCKCR3 register read + assert |
 * | **GPIO init** | ~5 us | [PENDING] Planned | Pin mode, pull-up/down, output levels |
 * | **Timer init** | ~10 us | [COMPLETE] | CMT0 setup for ThreadX tick |
 * | **UART debug** | ~50 us | [COMPLETE] | SCI9 baud rate, FIFO, interrupts |
 * | **SPI init** | ~20 us | [COMPLETE] | RSPI2 peripheral mode, 8-bit, mode 0 |
 * | **I2C init** | ~15 us | [PENDING] Planned | RIIC0 speed, addressing, interrupts |
 * | **ADC init** | ~100 us | [PENDING] Planned | ADC0 calibration, channel config |
 * | **Postcondition check** | ~0.5 us | [COMPLETE] | SCKCR3 stability verification |
 * | **Total (current)** | **~81 us** | Timers + UART + SPI + I2C | |
 * | **Total (planned)** | **~206 us** | All peripherals | |
 *
 * ## Memory Usage
 *
 * | Object | Size | Location | Purpose |
 * |--------|------|----------|---------|
 * | **s_sckcr3_reset_state** | 1 byte | .rodata | Clock validation constant |
 * | **Function stack** | ~64 bytes | Main stack | Local variables, return addresses |
 * | **Peripheral registers** | N/A | Memory-mapped | Hardware configuration only |
 *
 * **Total RAM:** ~64 bytes (stack only - no heap, no static buffers)
 *
 * ## Error Handling Strategy
 *
 * **Three-tier approach:**
 *
 * 1. **Critical errors (RX_ASSERT):**
 *    - Precondition failed (clocks not initialized)
 *    - Postcondition failed (clock system corrupted)
 *    - Register pointer NULL (memory map violation)
 *    - **Action:** Halt execution immediately (fail-fast)
 *
 * 2. **Peripheral errors (return error code):**
 *    - Timer init failed (timer_init() returns error)
 *    - UART init failed (uart_debug_init() returns error)
 *    - SPI/I2C/ADC init failed (when implemented)
 *    - **Action:** Return error to main(), which halts boot
 *
 * 3. **Non-critical warnings (log and continue):**
 *    - GPIO pin already configured (no action needed)
 *    - Peripheral module already enabled (idempotent operation)
 *    - **Action:** Log warning, return k_rx_ok
 *
 * ## NASA Power of 10 Compliance
 *
 * | Rule | Status | Implementation Notes |
 * |------|--------|----------------------|
 * | **Rule 1: Control flow** | [PASS] | No goto, setjmp, or recursion |
 * | **Rule 2: Loop bounds** | [PASS] | No loops (sequential initialization) |
 * | **Rule 3: Heap allocation** | [PASS] | Zero dynamic allocation (static only) |
 * | **Rule 4: Function length** | [PASS] | hardware_init() = 80 lines |
 * | **Rule 5: Assertions** | [PASS] | 2 preconditions, 1 postcondition |
 * | **Rule 6: Data scope** | [PASS] | All variables at function scope |
 * | **Rule 7: Return checks** | [PASS] | All init functions checked via rx_err_is_error() |
 * | **Rule 8: Preprocessor** | [PASS] | Zero macros (uses typed enum for constant) |
 * | **Rule 9: Pointers** | [PASS] | Single-level dereferencing only |
 * | **Rule 10: Warnings** | [PASS] | Compiles with -Wall -Wextra -Werror |
 *
 * ## SOLID Principles
 *
 * | Principle | Application |
 * |-----------|-------------|
 * | **Single Responsibility** | hardware_init() does ONLY peripheral setup (no business logic) |
 * | **Open/Closed** | New peripherals added without modifying existing init calls |
 * | **Liskov Substitution** | All init functions return rx_err_t with consistent semantics |
 * | **Interface Segregation** | Small, focused init APIs (timer_init, uart_init, etc. separate) |
 * | **Dependency Inversion** | Depends on abstractions (rx_err_t), not implementations |
 *
 * ## Thread Safety
 *
 * **Pre-ThreadX context:** This file executes in **single-threaded mode** before the RTOS starts.
 * No synchronization primitives needed. Hardware registers accessed directly without mutex protection.
 *
 * **Post-init:** After this function returns, peripherals are **ready for multi-threaded access**.
 * Application threads must use appropriate synchronization (mutexes, semaphores) when accessing
 * shared hardware resources.
 *
 * ## Related Files
 *
 * - **Clock init:** See [rx_clock_power_init.c](rx_clock_power_init.c) - Must complete BEFORE this file
 * - **Main entry:** See [main.c](main.c) - Calls this function during boot sequence
 * - **Timer HAL:** See [timer.c](../lib/rx_hal/src/timer.c) - CMT0 configuration for ThreadX tick
 * - **UART HAL:** See [uart.c](../lib/rx_hal/src/uart.c) - SCI9 configuration for debug console
 *
 * @note **This file is incomplete.** GPIO, I2C, and ADC initialization are planned but not yet
 *       implemented. Timers, UART, SPI, and I2C are functional in current version.
 *
 * @warning **Never call hardware_init() before rx_clock_power_init().** System clocks must be
 *          configured first. Precondition assertion will halt execution if violated.
 *
 * @see hardware_init() Main initialization function (entry point for this file)
 * @see rx_clock_power_init() System clock configuration (must call first)
 * @see timer_init() Configure CMT0 for ThreadX tick
 * @see uart_debug_init() Configure SCI9 for debug console
 *
 * @since Version 1.0.0
 *
 * @par Revision History:
 * - v1.1.0 (2026-02): Add GPIO helper functions for DRV8263H motor driver,
 *   IMU, sonar, ADC, and LED pin initialization
 * - v1.0.0 (2026-01): Initial implementation with timers and UART
 *
 * @date 2026-01-14
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 */

#include "hardware_init.h"

#include "hardware.h"
#include "rx72n_icu_regs.h"
#include "rx72n_sci_regs.h"
#include "rx72n_system_regs.h"
#include "rx_check.h"
#include "rx_err.h"
#include "rx_gptw.h"
#include "rx_irq_filter.h"
#include "rx_mpc.h"
#include "rx_poeg.h"
#include "rx_port_utils.h"
#include "rx_simulator_config.h" /* For RX_IS_SIMULATOR conditional compilation */
/**
 * @enum twake_delay_t
 * @brief DRV8263H-Q1 tWAKE busy-wait delay constants
 *
 * @details
 * Used for the pre-kernel busy-wait after nSLEEP assertion. ThreadX APIs
 * (tx_thread_sleep) cannot be used because hardware_init() runs before
 * tx_kernel_enter().
 *
 * @invariant k_twake_busy_wait_us must be > 0 and chosen to provide margin
 *            over the 1.2 ms tWAKE specification (current value gives ~10 ms)
 *
 * @code
 * internal_busy_wait_us(k_twake_busy_wait_us, k_twake_cpu_mhz);
 * @endcode
 *
 * @see twake_cpu_t CPU frequency constant for cycle calculation
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_twake_busy_wait_us = 2000, /**< Busy-wait duration in microseconds; actual delay ~10 ms due to
                                    ~5-6 CPU cycles per volatile decrement (margin over 1.2 ms spec) */
} twake_delay_t;

/**
 * @enum twake_cpu_t
 * @brief CPU frequency constant for tWAKE busy-wait cycle calculation
 *
 * @details
 * Separated from twake_delay_t because it represents a different physical
 * quantity (frequency vs. duration). Used to compute loop iteration count:
 * cycles = k_twake_busy_wait_us * k_twake_cpu_mhz.
 *
 * @invariant k_twake_cpu_mhz must be a positive integer representing the
 *            RX72N CPU frequency in MHz (240 for the STAR board)
 *
 * @code
 * volatile uint32_t cycles = (uint32_t)k_twake_busy_wait_us * (uint32_t)k_twake_cpu_mhz;
 * @endcode
 *
 * @see twake_delay_t Delay duration constant
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_twake_cpu_mhz = 240, /**< RX72N CPU frequency in MHz for cycle count calculation */
} twake_cpu_t;

/**
 * @brief Compile-time verification that tWAKE cycle count fits in uint32_t
 * @details Ensures k_twake_busy_wait_us * k_twake_cpu_mhz does not overflow
 *          the volatile uint32_t counter used in internal_busy_wait_us().
 */
static_assert((uint64_t)k_twake_busy_wait_us * (uint64_t)k_twake_cpu_mhz <= (uint64_t)UINT32_MAX,
              "tWAKE cycle count overflows uint32_t");

/** @brief Port pin identifiers for MPC configuration (rx_port_pin_t values) */
typedef enum : uint16_t {
  /* Host I2C (RIIC0) */
  k_pin_host_scl0 = k_rx_p1_2, /**< P1.2 - SCL0 (host I2C clock) */
  k_pin_host_sda0 = k_rx_p1_3, /**< P1.3 - SDA0 (host I2C data) */

  /* USB */
  k_pin_usb_vbus = k_rx_p1_6, /**< P1.6 - USB0_VBUS (USB VBUS detect) */

  /* HC-SR04 Sonar triggers (GPIO output, initial LOW) */
  k_pin_sonar_trig0 = k_rx_pf_5, /**< PF.5 - Sonar 0 trigger (pin 9) */
  k_pin_sonar_trig1 = k_rx_pj_5, /**< PJ.5 - Sonar 1 trigger (pin 11) */
  k_pin_sonar_trig2 = k_rx_pj_3, /**< PJ.3 - Sonar 2 trigger (pin 13) */
  k_pin_sonar_trig3 = k_rx_p3_3, /**< P3.3 - Sonar 3 trigger (pin 26) */

  /* HC-SR04 Sonar echoes (GPIO input, IRQ8-11) */
  k_pin_sonar_echo0 = k_rx_p0_3, /**< P0.3 - Sonar 0 echo (pin 4, IRQ11) */
  k_pin_sonar_echo1 = k_rx_p0_2, /**< P0.2 - Sonar 1 echo (pin 6, IRQ10) */
  k_pin_sonar_echo2 = k_rx_p0_1, /**< P0.1 - Sonar 2 echo (pin 7, IRQ9) */
  k_pin_sonar_echo3 = k_rx_p0_0, /**< P0.0 - Sonar 3 echo (pin 8, IRQ8) */

  /**
   * Host SPI (RSPI2 peripheral mode on PORTD)
   * - PD1 (MOSIC): COPI - Controller Out, Peripheral In (data from RPi5)
   * - PD2 (MISOC): CIPO - Controller In, Peripheral Out (data to RPi5)
   */
  k_pin_host_copi = k_rx_pd_1, /**< PD.1 - COPI/MOSIC (RPi5 -> RX72N) */
  k_pin_host_cipo = k_rx_pd_2, /**< PD.2 - CIPO/MISOC (RX72N -> RPi5) */
  k_pin_host_sclk = k_rx_pd_3, /**< PD.3 - SCLK (RSPI2 clock from RPi5) */
  k_pin_host_cs0  = k_rx_pd_4, /**< PD.4 - CS0 (chip select from RPi5) */

  /* Host control signals */
  k_pin_host_irq =
    k_rx_p6_7, /**< P6.7 - HOST_IRQ (active-low output to RPi5, data ready, pin 98) */

  /* MTU Encoder clock inputs (front wheels) */
  k_pin_enc0_pha = k_rx_p2_4, /**< P2.4 - MTCLKA (encoder 0 phase A) */
  k_pin_enc0_phb = k_rx_p2_5, /**< P2.5 - MTCLKB (encoder 0 phase B) */
  k_pin_enc1_pha = k_rx_pa_1, /**< PA.1 - MTCLKC (encoder 1 phase A) */
  k_pin_enc1_phb = k_rx_pc_5, /**< PC.5 - MTCLKD (encoder 1 phase B) */

