Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
static_assert((uint32_t)k_i2c_host_freq_hz >= (uint32_t)k_i2c_freq_min_hz,
              "Host I2C frequency must be non-zero");
static_assert((uint32_t)k_i2c_imu_freq_hz >= (uint32_t)k_i2c_freq_min_hz,
              "IMU I2C frequency must be non-zero");

/** @brief Number of motor current ADC channels */
typedef enum : uint8_t {
  k_motor_adc_count = 4, /**< 4 motors = 4 current sense channels */
} adc_count_t;

/**
 * @enum gpio_reg_constants_t
 * @brief Constants for GPIO register bit manipulation
 *
 * @details
 * Provides named constants for single-bit operations on 8-bit GPIO port
 * registers (PMR, PDR, PODR). Eliminates magic number `1U` in bit-shift
 * expressions and documents the hardware-imposed pin count limit.
 *
 * @invariant k_gpio_single_bit_mask == 1 (exactly one bit for shift operations)
 * @invariant k_gpio_max_pin_number == k_pins_per_port - 1
 *
 * @see internal_gpio_set_output() Uses these for register bit manipulation
 * @see internal_gpio_set_input() Uses these for register bit manipulation
 * @see k_pins_per_port From rx_gpio_constants.h (hardware 8-pin limit)
 *
 * @code{.c}
 * // Set pin 5 as output in PDR register (read-modify-write)
 * port->PDR |= (uint8_t)(k_gpio_single_bit_mask << k_bit_led);
 *
 * // Validate pin number before access
 * if (pin_number <= k_gpio_max_pin_number) {
 *     port->PODR |= (uint8_t)(k_gpio_single_bit_mask << pin_number);
 * }
 * @endcode
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_gpio_single_bit_mask = 1U, /**< Single-bit mask shifted by pin number for register RMW */
  k_gpio_max_pin_number  = 7U, /**< Maximum valid pin index (0-7, 8 pins per port) */
} gpio_reg_constants_t;

/** @brief SCKCR3 reset/unconfigured state value (before clock initialization) */
static const uint8_t s_sckcr3_reset_state = 0U;

/**
 * @brief Configure I2C bus pins (RIIC0/RIIC1)
 *
 * @details
 * Configures MPC pin multiplexing for Host I2C (RIIC0) on P1.2/P1.3 and
 * RIIC host I2C on P2.0/P2.1. Sets PSEL registers to enable I2C peripheral
 * function for SCL and SDA pins.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P1.2 configured as SCL0, P1.3 configured as SDA0
 * @post P2.1 configured as SCL1, P2.0 configured as SDA1
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_i2c(void)
{
  static const char* s_tag = "GPIO_I2C";

  /* Host I2C (RIIC0): SCL0 + SDA0 */
  rx_err_t err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_scl0);
  RX_RETURN_ON_ERROR(err, s_tag, "SCL0 pin config failed");

  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_sda0);
  RX_RETURN_ON_ERROR(err, s_tag, "SDA0 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure host SPI pins (RSPI2)
 *
 * @details
 * Configures MPC pin multiplexing for RSPI2 host SPI interface on PD.1-PD.4.
 * Sets PSEL registers to enable RSPI2 peripheral function for COPI, CIPO,
 * SCLK, and CS0 pins used for RPi5 communication.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post PD.1-PD.4 configured as RSPI2 COPI/CIPO/SCLK/CS0
 * @post RSPI2 pins ready for host communication
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_host_spi(void)
{
  static const char* s_tag = "GPIO_SPI";

  rx_err_t err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_copi);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 COPI pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_cipo);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 CIPO pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_sclk);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 SCLK pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_cs0);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 CS0 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure MTU encoder input pins (front wheels)
 *
 * @details
 * Configures MPC pin multiplexing for MTU external clock inputs MTCLKA-MTCLKD
 * on P2.4/P2.5/PA.1/PC.5. Enables pulse counter mode for quadrature encoder
 * inputs from front wheel motors.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P2.4/P2.5 configured as MTCLKA/MTCLKB
 * @post PA.1/PC.5 configured as MTCLKC/MTCLKD
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_mtu_encoders(void)
{
  static const char* s_tag = "GPIO_MTU_ENC";

  rx_err_t err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKA pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKB pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKC pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKD pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure TPU encoder input pins (rear wheels)
 *
 * @details
 * Configures MPC pin multiplexing for TPU external clock inputs TCLKA-TCLKD
 * on PC.2/PA.3/PC.0/PB.3. Enables pulse counter mode for quadrature encoder
 * inputs from rear wheel motors.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post PC.2/PA.3 configured as TCLKA/TCLKB
 * @post PC.0/PB.3 configured as TCLKC/TCLKD
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_tpu_encoders(void)
{
  static const char* s_tag = "GPIO_TPU_ENC";

  rx_err_t err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKA pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKB pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKC pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKD pin config failed");

