Locked-Inc/STAR/star-rx72n-firmware/src/hardware_init.c
  err = internal_gpio_init_imu_irq();
  RX_RETURN_ON_ERROR(err, s_tag, "IMU IRQ pin init failed");

  err = internal_gpio_init_adc();
  RX_RETURN_ON_ERROR(err, s_tag, "ADC pin init failed");

  err = internal_gpio_init_usb();
  RX_RETURN_ON_ERROR(err, s_tag, "USB VBUS pin init failed");

  err = internal_gpio_init_sonar_triggers();
  RX_RETURN_ON_ERROR(err, s_tag, "Sonar trigger pin init failed");

  err = internal_gpio_init_sonar_echoes();
  RX_RETURN_ON_ERROR(err, s_tag, "Sonar echo pin init failed");

  /* GTETRG nFAULT pins: no MPC config needed (documented in header) */

  rx_log_info(s_tag, "GPIO pin muxing complete");

  return k_rx_ok;
}

/**
 * @brief Initialize GPTW PWM for 4 motor channels with 90-degree phase staggering
 *
 * @details
 * Configures GPTW channels 0-3 for complementary PWM output at 20 kHz with
 * 1 us dead-time. Channels are phase-staggered by 90 degrees to reduce peak
 * current draw and EMI.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All 4 GPTW channels initialized successfully
 * @retval k_rx_err_hw_init_failed GPTW staggered init failed
 *
 * @pre GPIO pins for GPTW configured via gpio_init() (PSEL = 0x1E)
 * @pre PCLKA clock running at 120 MHz
 *
 * @post 4 GPTW channels configured for 20 kHz complementary PWM
 * @post Phase staggering active (0, 90, 180, 270 degrees)
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see rx_gptw_init_all_staggered() HAL function for staggered PWM init
 *
 * @since Version 1.0.0
 */
static rx_err_t gptw_pwm_init(void)
{
  static const char* s_tag = "GPTW";

  rx_gptw_config_t config = {.frequency_hz         = k_gptw_pwm_freq_hz,
                             .deadtime_ns          = k_gptw_deadtime_ns,
                             .wave_mode            = k_gptw_wave_saw_pwm,
                             .enable_complementary = true,
                             .invert_polarity      = false};

  rx_err_t err = rx_gptw_init_all_staggered(&config);
  RX_RETURN_ON_ERROR(err, s_tag, "GPTW staggered init failed");

  rx_log_info(s_tag, "4 channels @ 20kHz, 90-deg stagger");
  return k_rx_ok;
}

/**
 * @brief Initialize RSPI2 as SPI peripheral for RPi5 host communication
 *
 * @details
 * Configures RSPI2 in peripheral mode for receiving commands from the
 * Raspberry Pi 5 host controller. Uses SPI mode 0 (CPOL=0, CPHA=0) with
 * 8-bit transfers.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok RSPI2 peripheral initialized successfully
 * @retval k_rx_err_hw_init_failed RSPI2 init failed
 *
 * @pre GPIO pins for RSPI2 configured via gpio_init()
 * @pre PCLKA clock running
 *
 * @post RSPI2 ready to receive SPI transactions from RPi5
 * @post SPI mode 0, 8-bit transfers configured
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see rspi_init_peripheral() HAL function for RSPI peripheral mode
 *
 * @since Version 1.0.0
 */
static rx_err_t spi_init(void)
{
  static const char* s_tag = "SPI";

  rspi_config_t host_config = {.spi_mode = k_rspi_mode_0, .use_16bit = false};

  rx_err_t err = rspi_init_peripheral(k_rspi_channel_2, &host_config);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 peripheral init failed");

  rx_log_info(s_tag, "RSPI2 initialized (host peripheral, mode 0, 8-bit)");
  return k_rx_ok;
}

/**
 * @brief Initialize I2C buses for host communication and IMU sensors
 *
 * @details
 * Configures two RIIC channels:
 * - **RIIC0** at 400 kHz (fast mode) for RPi5 host I2C (P1.2 SCL0, P1.3 SDA0)
 * - **RIIC1** at 400 kHz (fast mode) for IMU sensors BNO055 + BMP280 (P2.1 SCL1, P2.0 SDA1)
 *
 * GPIO pins for RIIC0 are configured in internal_gpio_init_i2c(); pins for
 * RIIC1 (IMU) are configured in internal_gpio_init_imu().
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Static assertions passed; RIIC init deferred to bus manager
 *
 * @pre GPIO pins for RIIC0 configured via internal_gpio_init_i2c()
 * @pre GPIO pins for RIIC1 (IMU) configured via internal_gpio_init_imu()
 * @pre PCLKB clock running at 60 MHz
 *
 * @post Static frequency assertions verified at compile time
 * @post RIIC initialization deferred to rx_bus_i2c_init() in bus manager
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see rx_bus_i2c_init() Performs RIIC channel init on first bus registration
 * @see internal_gpio_init_imu() Configures P2.0/P2.1 for RIIC1
 *
 * @since Version 1.0.0
 */
static rx_err_t i2c_init(void)
{
  static const char* s_tag = "I2C";

  /* Precondition: channel and frequency values must be within valid range (NASA Rule 5) */
  static_assert((uint32_t)k_i2c_host_freq_hz <= (uint32_t)k_i2c_fast_mode_max_hz,
                "Host I2C frequency must not exceed 400 kHz fast mode");
  static_assert((uint32_t)k_i2c_imu_freq_hz <= (uint32_t)k_i2c_fast_mode_max_hz,
                "IMU I2C frequency must not exceed 400 kHz fast mode");

  /* RIIC initialization is deferred to the bus manager. Each call to
   * rx_bus_i2c_init() (via rx_bus_manager_register() in main.c) will call
   * riic_init() for its channel on first use and skip re-initialization for
   * shared-channel buses (e.g., "i2c1" and "i2c1_baro" both on RIIC1). */
  rx_log_info(s_tag, "RIIC initialization deferred to bus manager (rx_bus_i2c_init)");
  return k_rx_ok;
}

/**
 * @brief Initialize ADC channels for motor current sensing
 *
 * @details
 * Configures S12AD0 channels AN004-AN007 at 12-bit resolution for reading
 * motor current via analog sense inputs.
 *
 * | Channel | Motor | Pin |
 * |---------|-------|-----|
 * | AN007 | Motor 0 | P4.7 |
 * | AN006 | Motor 1 | P4.6 |
 * | AN005 | Motor 2 | P4.5 |
 * | AN004 | Motor 3 | P4.4 |
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All 4 ADC channels initialized
 * @retval k_rx_err_hw_init_failed ADC channel init failed
 *
 * @pre GPIO pins for ADC configured via gpio_init()
 * @pre PCLKB/PCLKD clock running
 *
 * @post S12AD0 channels AN004-AN007 ready for conversion
 * @post 12-bit resolution configured
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 *
 * @see adc_init() HAL function for ADC channel init
 *
 * @since Version 1.0.0
 */
static rx_err_t adc_init_channels(void)
{
  static const char* s_tag = "ADC";

  const adc_channel_t channels[k_motor_adc_count] = {
    k_adc_channel_7, /* Motor 0: AN007 */
    k_adc_channel_6, /* Motor 1: AN006 */
    k_adc_channel_5, /* Motor 2: AN005 */
    k_adc_channel_4  /* Motor 3: AN004 */
  };

  for (uint8_t i = 0; i < k_motor_adc_count; i++) {
    rx_err_t err = adc_init(k_adc_unit_0, channels[i], k_adc_resolution_12bit);
    RX_RETURN_ON_ERROR(err, s_tag, "ADC channel init failed");
  }

  rx_log_info(s_tag, "S12AD0 AN004-AN007 @ 12-bit");
  return k_rx_ok;
}

/**
 * @brief Non-fatal peripheral validation after initialization
 *
 * @details
 * Performs a test ADC conversion to verify the ADC subsystem is operational.
 * Logs warnings on failure but never halts - all checks are informational.
 *
 * @pre All peripheral init functions have completed
 *
 * @post Validation results logged
 * @post No state changes (read-only checks)
 *
 * @note Not thread-safe. Call during single-threaded initialization only.
 * @note Non-fatal: failures are logged as warnings, boot continues.
 *
 * @since Version 1.0.0
 */
static void validate_peripherals(void)
{
  static const char* s_tag = "VALIDATE";

  /* ADC test conversion on AN007 (motor 0 current) */
  uint16_t test_val = 0;
  if (adc_read(k_adc_unit_0, k_adc_channel_7, &test_val) == k_rx_ok) {
    rx_log_info(s_tag, "ADC0 test conversion OK");
  } else {
    rx_log_warn(s_tag, "ADC0 test conversion failed (non-fatal)");
  }

  rx_log_info(s_tag, "Peripheral validation complete");
}

/**
 * @var g_pin_host_irq
 * @brief Canonical pin identifier for the HOST_IRQ output signal (P6.7, active-low)
 *
 * @details
 * Single authoritative definition of the HOST_IRQ GPIO pin.  Consumers
 * (e.g. telemetry_task) use this constant with gpio_write_low() /
 * gpio_write_high() instead of embedding the raw port/bit literal.
 *
 * @note Read-only after hardware_init() completes.
 * @since Version 1.0.0
 * @see internal_gpio_init_host_irq() Configures pin direction and initial level
 */
const rx_port_pin_t g_pin_host_irq = (rx_port_pin_t)k_pin_host_irq;

/**
 * @brief Initialize all application-specific hardware peripherals for STAR motor controller
 *
 * @details
 * Configures **seven categories** of peripherals required by the STAR robot application:
 *
 * 1. **GPIO** ([PASS] implemented) - Motor control pins, LEDs, sensor chip selects
 * 2. **Timers** ([PASS] implemented) - CMT0 for ThreadX tick at 1 kHz
 * 3. **UART** ([PASS] implemented) - SCI9 for debug console at 115200 baud
 * 4. **SPI** ([PASS] implemented) - Host SPI peripheral (RSPI2), sensor bus
 * 5. **I2C** (planned) - IMU, temperature, pressure sensors
 * 7. **ADC** (planned) - Current sensing
 *
 * ## Initialization Sequence (7 Stages)
 *
 * **Stage order is CRITICAL** - violating dependencies causes failures:
 *
 * @msc
 * msc {
 *   width=700;
 *   Caller, HwInit, Timers, UART, SPI, I2C, ADC;
 *
 *   Caller => HwInit [label="hardware_init()"];
 *   HwInit note HwInit [label="Precondition: Check SCKCR3 != reset_state", textcolor="blue"];
 *   HwInit => HwInit [label="RX_ASSERT(clocks initialized)"];
 *   HwInit => Timers [label="timer_init()"];
 *   Timers => Timers [label="Configure CMT0\n1 kHz tick"];
 *   Timers => HwInit [label="k_rx_ok"];
 *   HwInit => UART [label="uart_debug_init()"];
 *   UART => UART [label="Configure SCI9\n115200 baud"];
 *   UART => HwInit [label="k_rx_ok"];
 *   HwInit => SPI [label="spi_init()"];
 *   SPI => SPI [label="Configure RSPI2\nhost peripheral"];
 *   SPI => HwInit [label="k_rx_ok"];
 *   HwInit => I2C [label="i2c_init()"];
 *   I2C => I2C [label="Configure RIIC0"];
 *   I2C => HwInit [label="k_rx_ok"];
 *   HwInit => ADC [label="adc_init_channels()"];
 *   ADC => ADC [label="Configure S12AD0\nAN004-AN007"];
 *   ADC => HwInit [label="k_rx_ok"];
 *   HwInit note HwInit [label="Postcondition: Check SCKCR3 still valid", textcolor="green"];
 *   HwInit => HwInit [label="RX_ASSERT(clocks not corrupted)"];
 *   HwInit => Caller [label="k_rx_ok"];
 * }
 * @endmsc
 *
 * ## Performance Characteristics (RX72N @ 240 MHz)
 *
 * | Stage | Duration | CPU Cycles | Implementation | Critical Path? |
 * |-------|----------|------------|----------------|----------------|
 * | **Precondition check** | 0.5 us | ~120 | [COMPLETE] | No |
 * | **Timer init (CMT0)** | 10 us | ~2,400 | [COMPLETE] | No |
 * | **UART init (SCI9)** | 50 us | ~12,000 | [COMPLETE] | No |
 * | **SPI init (RSPI2)** | 20 us | ~4,800 | [COMPLETE] | No |
 * | **I2C init (RIIC0+1)** | 15 us | ~3,600 | [COMPLETE] | No |
 * | **ADC init (S12AD0)** | 100 us | ~24,000 | [COMPLETE] | No |
 * | **Postcondition check** | 0.5 us | ~120 | [COMPLETE] | No |
 * | **Total (current)** | **~201 us** | **~48,240** | All peripherals | **No** |
 *
 * **Note:** Not on critical boot path. Total boot time (main to ThreadX) is ~51 ms,
 * dominated by USB enumeration (~50 ms) which happens later in comm_task.
 *
 * ## Memory Usage (Static Allocation Only)
 *
 * | Object | Size | Location | Lifetime |
 * |--------|------|----------|----------|
 * | **s_sckcr3_reset_state** | 1 byte | .rodata (Flash) | Permanent |
 * | **err (local variable)** | 2 bytes | Stack (Main stack) | Function duration |
 * | **Return address** | 4 bytes | Stack (Main stack) | Function duration |
 * | **Total stack usage** | ~64 bytes | Main stack (4 KB available) | Function duration |
 *
 * **Stack depth:** 1 level (hardware_init -> timer_init/uart_init)
 *
 * ## Error Handling and Recovery
 *
 * **Critical errors (assert-halt):**
 * - **Precondition:** SCKCR3 == reset_state -> Clocks not initialized (caller bug)
 * - **Postcondition:** SCKCR3 changed during init -> Clock corruption (peripheral bug)
 * - **Action:** RX_ASSERT halts execution with message
 *
 * **Peripheral errors (return error code):**
 * - **timer_init() failed** -> CMT0 configuration error (hardware or register access issue)
 * - **uart_debug_init() failed** -> SCI9 configuration error (baud rate calculation, pin config)
 * - **Action:** Return error to main(), which halts boot with error code
 *
 * **Recovery strategy:**
 * - On assert: Halt execution (developer investigates)
 * - On error return: main() halts boot (error logged via UART if possible)
 * - No partial initialization cleanup (fail-fast, no recovery)
 *
 * @return rx_err_t Initialization status
 * @retval k_rx_ok All peripherals initialized successfully
 * @retval k_rx_err_hw_init_failed Timer or UART initialization failed
 * @retval k_rx_err_timeout Peripheral configuration timeout (rare, indicates hardware fault)
 * @retval k_rx_err_invalid_state Peripheral already initialized or in unexpected state
 *
 * @pre System clocks configured via rx_clock_power_init() (SCKCR3 != reset_state)
 * @pre Interrupt vector table set up (reset vector, exception vectors)
 * @pre Stack pointer valid (at least 4 KB available in main stack)
 * @pre Memory protection unlocked if required (PRCR register)
 *
 * @post CMT0 configured for ThreadX tick at 1 kHz (timer interrupt enabled)
 * @post SCI9 configured for debug console at 115200 baud (UART TX/RX operational)
 * @post System clocks still operational (SCKCR3 unchanged from precondition)
 * @post Peripherals ready for application use (motor control, sensors, communication)
 *
 * @note **Call order:** rx_clock_power_init() -> hardware_init() -> tx_kernel_enter()
 *       Violating this order causes precondition assertion failure.
 *
 * @note **Not idempotent:** Calling hardware_init() multiple times may cause errors
 *       (peripherals already configured, interrupts already enabled). Only call once during boot.
 *
 * @warning **Never call before rx_clock_power_init().** Peripheral configuration requires
 *          stable system clocks. Precondition assertion will halt execution if violated.
 *
 * @warning **Boot order critical.** rx_infrastructure_init() must be called before
 *          hardware_init(). See main.c for the complete boot sequence.
 *
 * @par Thread Safety:
 * Executes in single-threaded context before ThreadX starts. No synchronization needed.
 *
 * @par Example Boot Sequence:
 * @code
 * int main(void) {
 *   rx_err_t ret;
 *
 *   // Stage 1: System clocks (240 MHz PLL)
 *   ret = rx_clock_power_init();
 *   RX_ERROR_CHECK(ret);
 *
 *   // Stage 2: Application peripherals (timers, UART, sensors)
 *   ret = hardware_init();
 *   if (ret != k_rx_ok) {
 *     // Log error (if UART initialized successfully)
 *     rx_log_error("MAIN", "Hardware initialization failed: %d", ret);
 *     // Halt boot
 *     while (1) { __asm__ volatile("wait"); }
 *   }
 *
 *   // Stage 3: Start ThreadX RTOS
 *   tx_kernel_enter();
 *
 *   // Never reached (scheduler takes over)
 * }
 * @endcode
 *
 * @par Example Error Handling:
 * @code
 * rx_err_t hardware_init(void) {
 *   rx_err_t err;
 *
 *   // Initialize timer (CMT0)
 *   err = timer_init();
 *   if (rx_err_is_error(err)) {
 *     // Cannot use rx_log_error yet (UART not initialized)
 *     return err;  // Propagate error to main()
 *   }
 *
 *   // Initialize UART (SCI9) - enables logging
 *   err = uart_debug_init();
 *   if (rx_err_is_error(err)) {
 *     // Still cannot log (UART init failed)
 *     return err;  // Propagate error to main()
 *   }
 *
 *   // Now logging is available for subsequent errors
 *   err = spi_init();
 *   if (rx_err_is_error(err)) {
 *     rx_log_error("HWINT", "SPI initialization failed: %d", err);
 *     return err;
 *   }
 *
 *   return k_rx_ok;
 * }
 * @endcode
 *
 * @par Planned Peripherals (Future Implementation):
 * - **GPIO:** Port initialization for motor control (PA0-PA7), LEDs (PB0-PB2), sensor CS (PC0-PC3)
 * - **SPI:** RSPI1 for sensor bus
 * - **I2C:** RIIC0 for IMU (MPU6050), temperature (LM75), pressure (BMP280)
 * - **ADC:** ADC0 channels for current sensing (4 channels)
 * - **USB:** USB CDC for ROS2 communication (already partially implemented, needs integration)
 *
 * @see rx_clock_power_init() System clock configuration (MUST call before this function)
 * @see timer_init() Configure CMT0 for ThreadX tick (called by this function)
 * @see uart_debug_init() Configure SCI9 for debug console (called by this function)
 * @see main() Main entry point (calls this function during boot)
 *
 * @since Version 1.0.0
 *
 * @test test_hardware_init.c Verify all peripherals initialize successfully
 * @test test_hardware_init.c Verify precondition assertion (clocks not initialized)
 * @test test_hardware_init.c Verify error propagation (timer/UART init failure)
 */
rx_err_t hardware_init(void)
{
  static const char* s_tag = "HW_INIT";

  /* =========================================================================
   * PRECONDITION: Verify system initialization
   * =========================================================================
   */

  /* Precondition: Verify that system clocks have been initialized
   * Clock initialization must complete before peripheral setup */
  RX_ASSERT((system_regs() != nullptr) && (system_regs()->sckcr3 != s_sckcr3_reset_state),
            "Precondition: Clock system not properly initialized");

  /* =========================================================================
   * INITIALIZE PERIPHERALS
   *
   * Order: GPIO -> GPTW -> Timer -> UART -> SPI -> I2C -> ADC -> Validate
   * Later stages depend on earlier stages (GPIO must precede peripherals).
   * =========================================================================
   */

#if !RX_IS_SIMULATOR
  /* 1. GPIO: Configure MPC pin multiplexing for all peripherals */
  rx_err_t err = gpio_init();
  RX_RETURN_ON_ERROR(err, s_tag, "GPIO initialization failed");

